"""
- 한 마을에 모험가가 N명 있다. 모험가 길드에서는 N명의 모험가를 대상으로 '공포도'를 측정했는데,
    공포도가 높은 모험가는 쉽게 공포를 느껴 위험 상황에서 제대로 대처할 능력이 떨어진다.
-  모함과 길드장인 동빈이는 모험가 그룹을 안전하게 구성하고자 공포도가 x인 모험가는 반드시
     X명 이상으로 구성한 모험가 그룹에 참여해야 여행을 떠날 수 있도록 규정했다
- 동빈이는 최대 몇 개의 모험가 그룹을 만들 수 있는지 궁금하다.
    N명의 모험가에 대한 정보가 주어졌을 때, 여행을 떠날 수 있는 그룹 수의 최댓값을
    구하는 프로그램을 작성해라
- 예를 들어 N=5이고, 각 모험가의 공포도가 2 3 1 2 2
- 이 경우 그룹 1에 공포도가 1,2,3인 모험가를 한명씩 넣고,
    그룹2에 공포도가 2인 남은 두명을 넣게 되면 총 2개의 그룹을 만들 수 있다.
- 또한 몇명의 모험가는 마을에 그대로 남아 있어도 되기 때문에,
    모든 모험가를 특정한 그룹에 넣을 필요는 없다.
1 2 2 2 3
[입력조건]
첫째 줄에 모험가의 수 N이 주어진다.
둘째 줄에 각 모험가의 공포도 값을 N이하의 자연수로 주어지며, 각 자연수는 공백으로 구분

[출력조건]
여행을 떠날 수 있는 그룹의 수의 최댓값을 출력한다.
"""

N = int(input())
people = list(map(int, input().split()))
people.sort()

group = 0  # 그룹 수
count = 0  # 모인사람들
for i in people:
    count += 1  # 모인사람 하나 증가
    if count >= i:
        group += 1
        count = 0  # 그룹 만들어지면 추가
print(group)
