"""
[문제]
10개의 수를 입력받아, 그 중에서 홀수만 더한 값을 출력하는 프로그램을 작성하라

[제약사항]
각 수는 0이상 10000 이하의 정수이다.

[입력]
가장 첫 줄에는 테스트 케이스의 개수 T가 주어지고,
그 아래로 각 테스트 케이스가 주어진다.
각 테스트 케이스의 첫 번째 줄에는 10개의 수가 주어진다.

[출력]
출력의 각 줄은 '#t'로 시작하고, 공백을 한 칸 둔 다음 정답을 출력한다.

[입력예시]
3
3 17 1 39 8 41 2 32 99 2
22 8 5 123 7 2 63 7 3 46
6 63 2 3 58 76 21 33 8 1

[출력예시]
#1 200
#2 208
#3 121
"""

T = int(input())
for test_case in range(1, T + 1):
    test = list(map(int, input().split()))
    ans = sum(i for i in test if i % 2 == 1)
    print(f"#{test_case} {ans}")
