"""
왕실의 나이트

[문제]
시 분으로 이루어진 시각을 2개 입력 받아, 더한 값을 시 분으로 출력하는 프로그램 작성
(시각은 12시간제로 표시한다. 즉, 시가 가질 수 있는 값은 1시부터 12시이다.)

[제약사항]
시는 1 이상 12 이하의 정수이다. 분은 0이상 59 이하의 정수이다.

[입력]
- 가장 첫 줄에는 테스트 케이스의 개수 T가 주어지고, 그 아래로 각 테스트 케이스가 주어진다.
- 각 테스트 케이스의 첫번재 줄에는 4개의 수가 주어진다.
- 첫번재 수가 시를 나타내고 두번째 수가 분을 나타낸다. 그다음 같은 형식으로 두번째 시각이 주어진다.
3
3 17 1 39
8 22 5 10
6 53 2 12

[출력]
출력의 각 줄은 #t 로 시작하고 공백을 한 칸 둔 다음, 시를 출력하고 공백을 한칸 둔 다음 분을 출력
#1 4 56
#2 1 32
#3 9 5
"""

T = int(input())
for test_case in range(1, T + 1):
    S1, B1, S2, B2 = map(int, input().split())
    Bun = B1 + B2
    Si = S1 + S2
    if Bun >= 60:
        Si += Bun // 60
        Bun %= 60
    Si = Si % 12
    if Si == 0:
        Si = 12
    print(f"#{test_case} {Si} {Bun}")
