"""
상하좌우
- 여행가 A는 N*N 크기의 정사각형 공간 위에 서 있다. 이 공간은 1*1 크기의 정사각형으로 나누어져 있다.
    가장 왼쪽 위 좌표는 (1,1)이며, 가장 아랫쪽 좌표는 (N,N)이다.
    여행가 A는 상,하,좌,우 방향으로 이동할 수 있다. 시작 좌표는 항상 (1,1)이다.
    우리 앞에는 여행가 A가 이동할 계획이 적힌 계획서가 있다.
- 계획서에는 하나의 줄 띄어쓰기를 기준으로 하여 L,R,U,D 중 하나의 문자가 반복적으로 적혀있다.
- 이때, 여행가 A가 N*N 크기의 정사각형을 벗어나는 움직임은 무시된다.

[입력조건]
- 첫째 줄에는 공간의 크기를 나타내는 N
- 둘째 줄에는 여행가 A가 이동할 계획서
5
R R R U D D

[출력조건]
첫 째 줄에 여행가 A가 최종적으로 도달할 지점의 좌표 (x,y)를 공백 기준으로 구분하여 출력
"""

N = int(input())
plan = list(map(str, input().split()))
x, y = 1, 1
keyboard = {"U": [-1, 0], "D": [1, 0], "R": [0, 1], "L": [0, -1]}
for i in plan:
    next = keyboard[i]
    if x + next[0] < 1 or x + next[0] > N or y + next[1] < 1 or y + next[1] > N:
        continue
    else:
        x += next[0]
        y += next[1]

print(f"{x} {y}")
