"""
[문제 설명]
- 행복 왕국의 왕실 정원은 체스판과 같은 8*8 좌표평면이다.
    왕실 정원의 특정한 칸에 나이트가 서있다.
- 나이트는 말을 타고 있기 때문에 이동할 때는 L자 형태로만 이동할 수 있다.
- 나이트는 특정 위치에서 다음과 같은 2가지 경우로 이동할 수 있다.
    1. 수평으로 두 칸 이동한 뒤에 수직으로 한 칸 이동하기
    2. 수직으로 두 칸 이동한 뒤에 수평으로 한 칸 이동하기

[입력 조건]
- 첫째 줄에 8*8 좌표 평면상에서 현재 나이트가 위치한 곳의 좌표를 나타내는 두 문자로
    구성된 문자열이 입력된다. 입력 문자는 a1처럼 열과 행으로 이루어진다.
a1

[출력 예시]
- 첫째줄에 나이트가 이동할 수 있는 경우의 수를 출력하시오.
2
"""

start = input()
trans = {"a": 1, "b": 2, "c": 3, "d": 4, "e": 5, "f": 6, "g": 7, "h": 8}
x, y = trans[start[0]], int(start[1])
count = 0

if x - 2 > 0:
    if y - 1 > 0:
        count += 1
    if y + 1 < 9:
        count += 1


if x + 2 < 9:
    if y - 1 > 0:
        count += 1
    if y + 1 < 9:
        count += 1

if y - 2 > 0:
    if x - 1 > 0:
        count += 1
    if x + 1 < 9:
        count += 1

if y + 2 < 9:
    if x - 1 > 0:
        count += 1
    if x + 1 < 9:
        count += 1

print(count)
